Repository: python/pootle-python-org-backup
Catalog: tmxes/pt/faq.tmx
Source language: en
Languages: pt

source: Design and History FAQ
pt: FAQ Design e História

source: Why does Python use indentation for grouping of statements?
pt: Porque Python usa identação para blocos de codigos?

source: Guido van Rossum believes that using indentation for grouping is extremely elegant and contributes a lot to the clarity of the average Python program. Most people learn to love this feature after a while.
pt: Guido van Rossum acredita que usar identação para blocos de codigo é extremamente elegante e contribui muito o entendimento do programa Python

source: Since there are no begin/end brackets there cannot be a disagreement between grouping perceived by the parser and the human reader. Occasionally C programmers will encounter a fragment of code like this::
pt: Como não existem os delimitadores de bloco de código begin/end não pode haver uma discordância entre o compilador e o programador. Ocasionalmente programadores C encontrarão um fragmento de código como esse:

source: Only the ``x++`` statement is executed if the condition is true, but the indentation leads you to believe otherwise. Even experienced C programmers will sometimes stare at it a long time wondering why ``y`` is being decremented even for ``x > y``.
pt: A declaração "x++" é executada se a condição é verdadeira, mas a identação leva a crer o contrario. Mesmo programadores experientes em C, por vezes, olham para a declaração e se perguntam porque "y" está sendo decrementado mesmo para "x > y".

source: Because there are no begin/end brackets, Python is much less prone to coding-style conflicts. In C there are many different ways to place the braces. If you're used to reading and writing code that uses one style, you will feel at least slightly uneasy when reading (or being required to write) another style.
pt: Já que não existe delimitadores begin/end, Python é muito menos propenso a conflitos de estilo de código. Em C existem muitas diferentes maneiras para usar estes delimitadores. Se você estava acostumado a ler e escrever código que usa um determinado estilo, você se sentirá um pouco desconfortável quando for ler (ou ser requisitado a escrever) outro estilo

source: Why am I getting strange results with simple arithmetic operations?
pt: Por que estou tendo resultados estranhos com operações aritméticas simples?

source: See the next question.
pt: Veja a próxima questão.

source: Why are floating point calculations so inaccurate?
pt: Por que cálculos com pontos flutuantes são tão imprecisos?

source: People are often very surprised by results like this::
pt: Pessoas ficam frequentemente muito surpresas com resultados como estes:

source: In decimal math, there are many numbers that can't be represented with a fixed number of decimal digits, e.g. 1/3 = 0.3333333333.......
pt: Na matemática decimal há vários números que não podem ser representados por um número fixo de casas decimais, e.g. 1/3 = 0.3333333333...

source: In base 2, 1/2 = 0.1, 1/4 = 0.01, 1/8 = 0.001, etc. .2 equals 2/10 equals 1/5, resulting in the binary fractional number 0.001100110011001...
pt: Na base 2, 1/2 = 0.1, 1/4 = 0.01, 1/8 = 0.001, etc. .2 é igual a 2/10 é igual a 1/5, resultando no número binário fracionário 0.001100110011001...

source: There are several advantages.
pt: Existem várias vantagens.

source: One is performance: knowing that a string is immutable means we can allocate space for it at creation time, and the storage requirements are fixed and unchanging. This is also one of the reasons for the distinction between tuples and lists.
pt: Uma é a performance: saber que uma string é imutável significa que podemos alocar espaço para ela na sua criação, e os requisitos de armazenamento são fixados e não mudam. Esta também é uma das razões para a distinção entre tuplas e listas.

source: while (line = readline(f)) { // do something with line }
pt: while (line = readline(f)) { // faz algo com line }

source: where in Python you're forced to write this::
pt: onde em Python você é forçado a escrever isto::

source: while True: line = f.readline() if not line: break ... # do something with line
pt: while True: line = f.readline() if not line: break ... # faz algo com line

source: if (x = 0) { // error handling } else { // code that only works for nonzero x }
pt: if (x = 0) { // erro de manipulação } else { // código que funciona para x diferente de 0 }

source: line = f.readline() while line: ... # do something with line... line = f.readline()
pt: line = f.readline() while line: ... # faz algo com line... line = f.readline()

source: for line in f: ... # do something with line...
pt: for line in f: ... # faz algo com line...

source: Why is join() a string method instead of a list or tuple method?
pt: Por que join() é um método de string em vez de um método de uma lista ou tupla?
